using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;
using System.Web.Mvc;
using TWNewEgg.API.View.Models;
using TWNewEgg.DB;
using TWNewEgg.DB.TWBACKENDDB.Models;
using TWNewEgg.DB.TWSQLDB.Models;

namespace TWNewEgg.API.View.Service
{
    public class AddressParseService
    {
        //public JsonResult SplitCityAddress(bool recv, string county, string city, string address, string zipCode)
        public AddressQuery SplitCityAddress(bool recv, string county, string city, string address, string zipCode)
        {
            TWSqlDBContext db_before = new TWSqlDBContext();
            TWBackendDBContext db_after = new TWBackendDBContext();
            
            // 前台
            List<Addressbook> addressbookList = new List<Addressbook>();
            List<SalesOrder> salesOrderList = new List<SalesOrder>();
            List<TWNewEgg.DB.TWSQLDB.Models.PurchaseOrder> purchaseOrderList = new List<TWNewEgg.DB.TWSQLDB.Models.PurchaseOrder>();
            // 後台
            List<Cart> cartList = new List<Cart>();
            List<PurchaseOrderTWBACK> purchaseOrderTWBACKList = new List<PurchaseOrderTWBACK>();
            AddressQuery getCityAndAddress = new AddressQuery();
            if (!string.IsNullOrEmpty(zipCode))
            {
                getCityAndAddress = (AddressQuery)AddressAnalyse(recv, county, address, zipCode.Trim());//.Data;
            }
            //return Json(new { AddressQuery = addressQuery });
            return getCityAndAddress;
        }






        /// <summary>
        /// 鄉鎮市區與街道等解析
        /// </summary>
        /// <param name="address"></param>
        /// <returns></returns>
        //public JsonResult AddressAnalyse(bool recv, string county, string address, string zipCode)
        public AddressQuery AddressAnalyse(bool recv, string county, string address, string zipCode)
        {
            bool successFlag = false;
            char KeyWord = new char();
            AddressQuery addressQuery = new AddressQuery();
            foreach (char subString in address)
            {
                if (subString.ToString().IndexOf('鄉') >= 0)
                {
                    // 驗證該鄉鎮市區是否存在
                    if (CityCheck(recv, county, address.Split('鄉')[0] + "鄉", zipCode.Trim()))
                    {
                        KeyWord = '鄉';
                        successFlag = true;
                        break;
                    }
                }
                else if (subString.ToString().IndexOf('鎮') >= 0)
                {
                    if (CityCheck(recv, county, address.Split('鎮')[0] + "鎮", zipCode.Trim()))
                    {
                        KeyWord = '鎮';
                        successFlag = true;
                        break;
                    }
                }
                else if (subString.ToString().IndexOf('市') >= 0)
                {
                    if (CityCheck(recv, county, address.Split('市')[0] + "市", zipCode.Trim()))
                    {
                        KeyWord = '市';
                        successFlag = true;
                        break;
                    }
                }
                else if (subString.ToString().IndexOf('區') >= 0)
                {
                    if (CityCheck(recv, county, address.Split('區')[0] + "區", zipCode.Trim()))
                    {
                        KeyWord = '區';
                        successFlag = true;
                        break;
                    }
                }
            }

            // 若查詢的資料是存在的
            if (successFlag)
            {
                addressQuery.FindCity = true;
                addressQuery.County = county;
                addressQuery.City = address.Split(KeyWord)[0] + KeyWord;
                if (address.Split(KeyWord).Length == 2)
                {
                    addressQuery.Addr = address.Split(KeyWord)[1];
                }
                else
                {
                    for (int subAddr = 1; subAddr < address.Split(KeyWord).Length - 1; subAddr++)
                    {
                        addressQuery.Addr += address.Split(KeyWord)[subAddr] + KeyWord;
                    }
                    addressQuery.Addr += address.Split(KeyWord)[address.Split(KeyWord).Length - 1];
                }
                addressQuery.ZipCode = zipCode;
                //return Json(new { AddressQuery = addressQuery });
                return addressQuery;
            }

            // 若查詢的資料不存在，FindCity = false(預設)
            //return Json(new { AddressQuery = addressQuery });
            return addressQuery;
        }

        /// <summary>
        /// 驗證該鄉鎮市區是否存在
        /// </summary>
        /// <param name="recv"></param>
        /// <param name="county"></param>
        /// <param name="city"></param>
        /// <param name="zipCode"></param>
        /// <returns>若存在則回傳true，不存在則回傳false</returns>
        public bool CityCheck(bool recv, string county, string city, string zipCode)
        {
            string[][] twAddrData = null;
            if (!recv)
            {
                twAddrData = new string[][]
                {
                    new string[] {"基隆市", "200:仁愛區", "201:信義區", "202:中正區", "203:中山區", "204:安樂區", "205:暖暖區", "206:七堵區"},
                    new string[] {"台北市", "100:中正區", "103:大同區", "104:中山區", "105:松山區", "106:大安區", "108:萬華區", "110:信義區", "111:士林區", "112:北投區", "114:內湖區", "115:南港區", "116:文山區"},
                    new string[] {"新北市", "207:萬里區", "208:金山區", "220:板橋區", "221:汐止區", "222:深坑區", "223:石碇區", "224:瑞芳區", "226:平溪區", "227:雙溪區", "228:貢寮區", "231:新店區", "232:坪林區", "233:烏來區", "234:永和區", "235:中和區", "236:土城區", "237:三峽區", "238:樹林區", "239:鶯歌區", "241:三重區", "242:新莊區", "243:泰山區", "244:林口區", "247:蘆洲區", "248:五股區", "249:八里區", "251:淡水區", "252:三芝區", "253:石門區"},
                    new string[] {"桃園縣", "320:中壢市", "324:平鎮市", "325:龍潭鄉", "326:楊梅市", "327:新屋鄉", "328:觀音鄉", "330:桃園市", "333:龜山鄉", "334:八德市", "335:大溪鎮", "336:復興鄉", "337:大園鄉", "338:蘆竹鄉"},
                    new string[] {"新竹市", "300:東區", "300:北區", "300:香山區"},
                    new string[] {"新竹縣", "302:竹北市", "303:湖口鄉", "304:新豐鄉", "305:新埔鎮", "306:關西鎮", "307:芎林鄉", "308:寶山鄉", "310:竹東鎮", "311:五峰鄉", "312:橫山鄉", "313:尖石鄉", "314:北埔鄉", "315:峨眉鄉"},
                    new string[] {"苗栗縣", "350:竹南鎮", "351:頭份鎮", "352:三灣鄉", "353:南庄鄉", "354:獅潭鄉", "356:後龍鎮", "357:通霄鎮", "358:苑裡鎮", "360:苗栗市", "361:造橋鄉", "362:頭屋鄉", "363:公館鄉", "364:大湖鄉", "365:泰安鄉", "366:銅鑼鄉", "367:三義鄉", "368:西湖鄉", "369:卓蘭鎮"},
                    new string[] {"台中市", "400:中區", "401:東區", "402:南區", "403:西區", "404:北區", "406:北屯區", "407:西屯區", "408:南屯區", "411:太平區", "412:大里區", "413:霧峰區", "414:烏日區", "420:豐原區", "421:后里區", "422:石岡區", "423:東勢區", "424:和平區", "426:新社區", "427:潭子區", "428:大雅區", "429:神岡區", "432:大肚區", "433:沙鹿區", "434:龍井區", "435:梧棲區", "436:清水區", "437:大甲區", "438:外埔區", "439:大安區"},
                    new string[] {"彰化縣", "500:彰化市", "502:芬園鄉", "503:花壇鄉", "504:秀水鄉", "505:鹿港鎮", "506:福興鄉", "507:線西鄉", "508:和美鎮", "509:伸港鄉", "510:員林鎮", "511:社頭鄉", "512:永靖鄉", "513:埔心鄉", "514:溪湖鎮", "515:大村鄉", "516:埔鹽鄉", "520:田中鎮", "521:北斗鎮", "522:田尾鄉", "523:埤頭鄉", "524:溪州鄉", "525:竹塘鄉", "526:二林鎮", "527:大城鄉", "528:芳苑鄉", "530:二水鄉"},
                    new string[] {"南投縣", "540:南投市", "541:中寮鄉", "542:草屯鎮", "544:國姓鄉", "545:埔里鎮", "546:仁愛鄉", "551:名間鄉", "552:集集鎮", "553:水里鄉", "555:魚池鄉", "556:信義鄉", "557:竹山鎮", "558:鹿谷鄉"},
                    new string[] {"雲林縣", "630:斗南鎮", "631:大埤鄉", "632:虎尾鎮", "633:土庫鎮", "635:東勢鄉", "634:褒忠鄉", "636:台西鄉", "637:崙背鄉", "638:麥寮鄉", "640:斗六市", "643:林內鄉", "646:古坑鄉", "647:莿桐鄉", "648:西螺鎮", "649:二崙鄉", "651:北港鎮", "652:水林鄉", "653:口湖鄉", "654:四湖鄉", "655:元長鄉"},
                    new string[] {"嘉義市", "600:東區", "600:西區"},
                    new string[] {"嘉義縣", "602:番路鄉", "603:梅山鄉", "604:竹崎鄉", "605:阿里山鄉", "606:中埔鄉", "607:大埔鄉", "608:水上鄉", "611:鹿草鄉", "612:太保市", "613:朴子市", "614:東石鄉", "615:六腳鄉", "616:新港鄉", "621:民雄鄉", "622:大林鎮", "623:溪口鄉", "624:義竹鄉", "625:布袋鎮"},
                    new string[] {"台南市", "700:中西區", "701:東區", "702:南區", "704:北區", "708:安平區", "709:安南區", "710:永康區", "711:歸仁區", "712:新化區", "713:左鎮區", "714:玉井區", "715:楠西區", "717:仁德區", "718:關廟區", "716:南化區", "719:龍崎區", "720:官田區", "721:麻豆區", "722:佳里區", "723:西港區", "724:七股區", "725:將軍區", "726:學甲區", "727:北門區", "730:新營區", "731:後壁區", "732:白河區", "733:東山區", "734:六甲區", "735:下營區", "736:柳營區", "737:鹽水區", "741:善化區", "742:大內區", "744:新市區", "745:安定區", "743:山上區"},
                    new string[] {"高雄市", "800:新興區", "801:前金區", "802:苓雅區", "803:鹽埕區", "804:鼓山區", "805:旗津區", "806:前鎮區", "807:三民區", "811:楠梓區", "812:小港區", "813:左營區", "814:仁武區", "815:大社區", "817:東沙群島", "820:岡山區", "821:路竹區", "819:南沙群島", "822:阿蓮區", "823:田寮區", "824:燕巢區", "825:橋頭區", "826:梓官區", "827:彌陀區", "829:湖內區", "828:永安區", "830:鳳山區", "831:大寮區", "832:林園區", "833:鳥松區", "840:大樹區", "842:旗山區", "843:美濃區", "844:六龜區", "845:內門區", "847:甲仙區", "846:杉林區", "848:桃源區", "852:茄萣區", "851:茂林區", "849:那瑪夏區"},
                    new string[] {"屏東縣", "900:屏東市", "901:三地門鄉", "902:霧台鄉", "903:瑪家鄉", "904:九如鄉", "905:里港鄉", "906:高樹鄉", "907:鹽埔鄉", "908:長治鄉", "909:麟洛鄉", "911:竹田鄉", "912:內埔鄉", "913:萬丹鄉", "920:潮州鎮", "921:泰武鄉", "923:萬巒鄉", "922:來義鄉", "924:崁頂鄉", "925:新埤鄉", "926:南州鄉", "927:林邊鄉", "928:東港鎮", "929:琉球鄉", "931:佳冬鄉", "932:新園鄉", "940:枋寮鄉", "941:枋山鄉", "943:獅子鄉", "944:車城鄉", "945:牡丹鄉", "946:恆春鎮", "947:滿州鄉", "942:春日鄉"},
                    new string[] {"台東縣", "950:台東市", "951:綠島鄉", "952:蘭嶼鄉", "954:卑南鄉", "955:鹿野鄉", "956:關山鎮", "957:海端鄉", "958:池上鄉", "953:延平鄉", "959:東河鄉", "961:成功鎮", "962:長濱鄉", "963:太麻里鄉", "965:大武鄉", "966:達仁鄉", "964:金峰鄉"},
                    new string[] {"花蓮縣", "970:花蓮市", "971:新城鄉", "972:秀林鄉", "973:吉安鄉", "974:壽豐鄉", "975:鳳林鎮", "976:光復鄉", "977:豐濱鄉", "978:瑞穗鄉", "981:玉里鎮", "979:萬榮鄉", "983:富里鄉", "982:卓溪鄉"},
                    new string[] {"宜蘭縣", "260:宜蘭市", "261:頭城鎮", "262:礁溪鄉", "263:壯圍鄉", "264:員山鄉", "265:羅東鎮", "266:三星鄉", "267:大同鄉", "268:五結鄉", "269:冬山鄉", "270:蘇澳鎮", "272:南澳鄉", "290:釣魚台"},
                    new string[] {"澎湖縣", "880:馬公市", "881:西嶼鄉", "882:望安鄉", "885:湖西鄉", "883:七美鄉", "884:白沙鄉"},
                    new string[] {"金門縣", "890:金沙鎮", "891:金湖鎮", "892:金寧鄉", "893:金城鎮", "894:烈嶼鄉", "896:烏坵鄉"},
                    new string[] {"連江縣", "209:南竿鄉", "210:北竿鄉", "211:莒光鄉", "212:東引鄉"},
                };
            }
            else
            {
                twAddrData = new string[][]
                {
                    new string[] {"基隆市", "200:仁愛區", "201:信義區", "202:中正區", "203:中山區", "204:安樂區", "205:暖暖區", "206:七堵區"},
                    new string[] {"台北市", "100:中正區", "103:大同區", "104:中山區", "105:松山區", "106:大安區", "108:萬華區", "110:信義區", "111:士林區", "112:北投區", "114:內湖區", "115:南港區", "116:文山區"},
                    new string[] {"新北市", "207:萬里區", "208:金山區", "220:板橋區", "221:汐止區", "222:深坑區", "223:石碇區", "224:瑞芳區", "226:平溪區", "227:雙溪區", "228:貢寮區", "231:新店區", "232:坪林區", "233:烏來區", "234:永和區", "235:中和區", "236:土城區", "237:三峽區", "238:樹林區", "239:鶯歌區", "241:三重區", "242:新莊區", "243:泰山區", "244:林口區", "247:蘆洲區", "248:五股區", "249:八里區", "251:淡水區", "252:三芝區", "253:石門區"},
                    new string[] {"桃園縣", "320:中壢市", "324:平鎮市", "325:龍潭鄉", "326:楊梅市", "327:新屋鄉", "328:觀音鄉", "330:桃園市", "333:龜山鄉", "334:八德市", "335:大溪鎮", "336:復興鄉", "337:大園鄉", "338:蘆竹鄉"},
                    new string[] {"新竹市", "300:東區", "300:北區", "300:香山區"},
                    new string[] {"新竹縣", "302:竹北市", "303:湖口鄉", "304:新豐鄉", "305:新埔鎮", "306:關西鎮", "307:芎林鄉", "308:寶山鄉", "310:竹東鎮", "311:五峰鄉", "312:橫山鄉", "313:尖石鄉", "314:北埔鄉", "315:峨眉鄉"},
                    new string[] {"苗栗縣", "350:竹南鎮", "351:頭份鎮", "352:三灣鄉", "353:南庄鄉", "354:獅潭鄉", "356:後龍鎮", "357:通霄鎮", "358:苑裡鎮", "360:苗栗市", "361:造橋鄉", "362:頭屋鄉", "363:公館鄉", "364:大湖鄉", "365:泰安鄉", "366:銅鑼鄉", "367:三義鄉", "368:西湖鄉", "369:卓蘭鎮"},
                    new string[] {"台中市", "400:中區", "401:東區", "402:南區", "403:西區", "404:北區", "406:北屯區", "407:西屯區", "408:南屯區", "411:太平區", "412:大里區", "413:霧峰區", "414:烏日區", "420:豐原區", "421:后里區", "422:石岡區", "423:東勢區", "424:和平區", "426:新社區", "427:潭子區", "428:大雅區", "429:神岡區", "432:大肚區", "433:沙鹿區", "434:龍井區", "435:梧棲區", "436:清水區", "437:大甲區", "438:外埔區", "439:大安區"},
                    new string[] {"彰化縣", "500:彰化市", "502:芬園鄉", "503:花壇鄉", "504:秀水鄉", "505:鹿港鎮", "506:福興鄉", "507:線西鄉", "508:和美鎮", "509:伸港鄉", "510:員林鎮", "511:社頭鄉", "512:永靖鄉", "513:埔心鄉", "514:溪湖鎮", "515:大村鄉", "516:埔鹽鄉", "520:田中鎮", "521:北斗鎮", "522:田尾鄉", "523:埤頭鄉", "524:溪州鄉", "525:竹塘鄉", "526:二林鎮", "527:大城鄉", "528:芳苑鄉", "530:二水鄉"},
                    new string[] {"南投縣", "540:南投市", "541:中寮鄉", "542:草屯鎮", "544:國姓鄉", "545:埔里鎮", "546:仁愛鄉", "551:名間鄉", "552:集集鎮", "553:水里鄉", "555:魚池鄉", "556:信義鄉", "557:竹山鎮", "558:鹿谷鄉"},
                    new string[] {"雲林縣", "630:斗南鎮", "631:大埤鄉", "632:虎尾鎮", "633:土庫鎮", "635:東勢鄉", "634:褒忠鄉", "636:台西鄉", "637:崙背鄉", "638:麥寮鄉", "640:斗六市", "643:林內鄉", "646:古坑鄉", "647:莿桐鄉", "648:西螺鎮", "649:二崙鄉", "651:北港鎮", "652:水林鄉", "653:口湖鄉", "654:四湖鄉", "655:元長鄉"},
                    new string[] {"嘉義市", "600:東區", "600:西區"},
                    new string[] {"嘉義縣", "602:番路鄉", "603:梅山鄉", "604:竹崎鄉", "605:阿里山鄉", "606:中埔鄉", "607:大埔鄉", "608:水上鄉", "611:鹿草鄉", "612:太保市", "613:朴子市", "614:東石鄉", "615:六腳鄉", "616:新港鄉", "621:民雄鄉", "622:大林鎮", "623:溪口鄉", "624:義竹鄉", "625:布袋鎮"},
                    new string[] {"台南市", "700:中西區", "701:東區", "702:南區", "704:北區", "708:安平區", "709:安南區", "710:永康區", "711:歸仁區", "712:新化區", "713:左鎮區", "714:玉井區", "715:楠西區", "717:仁德區", "718:關廟區", "716:南化區", "719:龍崎區", "720:官田區", "721:麻豆區", "722:佳里區", "723:西港區", "724:七股區", "725:將軍區", "726:學甲區", "727:北門區", "730:新營區", "731:後壁區", "732:白河區", "733:東山區", "734:六甲區", "735:下營區", "736:柳營區", "737:鹽水區", "741:善化區", "742:大內區", "744:新市區", "745:安定區", "743:山上區"},
                    new string[] {"高雄市", "800:新興區", "801:前金區", "802:苓雅區", "803:鹽埕區", "804:鼓山區", "805:旗津區", "806:前鎮區", "807:三民區", "811:楠梓區", "812:小港區", "813:左營區", "814:仁武區", "815:大社區"/*, "817:東沙群島"*/, "820:岡山區", "821:路竹區"/*, "819:南沙群島"*/, "822:阿蓮區", "823:田寮區", "824:燕巢區", "825:橋頭區", "826:梓官區", "827:彌陀區", "829:湖內區", "828:永安區", "830:鳳山區", "831:大寮區", "832:林園區", "833:鳥松區", "840:大樹區", "842:旗山區", "843:美濃區", "844:六龜區", "845:內門區", "847:甲仙區", "846:杉林區", "848:桃源區", "852:茄萣區", "851:茂林區", "849:那瑪夏區"},
                    new string[] {"屏東縣", "900:屏東市", "901:三地門鄉", "902:霧台鄉", "903:瑪家鄉", "904:九如鄉", "905:里港鄉", "906:高樹鄉", "907:鹽埔鄉", "908:長治鄉", "909:麟洛鄉", "911:竹田鄉", "912:內埔鄉", "913:萬丹鄉", "920:潮州鎮", "921:泰武鄉", "923:萬巒鄉", "922:來義鄉", "924:崁頂鄉", "925:新埤鄉", "926:南州鄉", "927:林邊鄉", "928:東港鎮"/*, "929:琉球鄉"*/, "931:佳冬鄉", "932:新園鄉", "940:枋寮鄉", "941:枋山鄉", "943:獅子鄉", "944:車城鄉", "945:牡丹鄉", "946:恆春鎮", "947:滿州鄉", "942:春日鄉"},
                    new string[] {"台東縣", "950:台東市", /*"951:綠島鄉", "952:蘭嶼鄉",*/ "954:卑南鄉", "955:鹿野鄉", "956:關山鎮", "957:海端鄉", "958:池上鄉", "953:延平鄉", "959:東河鄉", "961:成功鎮", "962:長濱鄉", "963:太麻里鄉", "965:大武鄉", "966:達仁鄉", "964:金峰鄉"},
                    new string[] {"花蓮縣", "970:花蓮市", "971:新城鄉", "972:秀林鄉", "973:吉安鄉", "974:壽豐鄉", "975:鳳林鎮", "976:光復鄉", "977:豐濱鄉", "978:瑞穗鄉", "981:玉里鎮", "979:萬榮鄉", "983:富里鄉", "982:卓溪鄉"},
                    new string[] {"宜蘭縣", "260:宜蘭市", "261:頭城鎮", "262:礁溪鄉", "263:壯圍鄉", "264:員山鄉", "265:羅東鎮", "266:三星鄉", "267:大同鄉", "268:五結鄉", "269:冬山鄉", "270:蘇澳鎮", "272:南澳鄉"/*, "290:釣魚台"*/},
                    new string[] {"澎湖縣", "880:馬公市", "881:西嶼鄉", "882:望安鄉", "885:湖西鄉", "883:七美鄉", "884:白沙鄉"},
                    new string[] {"金門縣", "890:金沙鎮", "891:金湖鎮", "892:金寧鄉", "893:金城鎮", "894:烈嶼鄉", "896:烏坵鄉"},
                    new string[] {"連江縣", "209:南竿鄉", "210:北竿鄉", "211:莒光鄉", "212:東引鄉"},
                };
            }

            int countyNumber = 0;
            // 找出縣市位置
            for (int countyi = 0; countyi < 22; countyi++)
            {
                if (twAddrData[countyi][0] == county)
                {
                    countyNumber = countyi;
                    break;
                }
            }

            // 驗證該鄉鎮市區是否存在
            for (int cityi = 0; cityi < twAddrData[countyNumber].Length; cityi++)
            {
                if (twAddrData[countyNumber][cityi] == zipCode + ":" + city)
                {
                    twAddrData = null;
                    // 若存在則回傳true
                    return true;
                }
            }

            twAddrData = null;
            // 若不存在則回傳false
            return false;
        }
    }
}